<template>
  <section class='about' id="О нас">
    <div class="about__wrap-bg">
      <div class="about__bg"></div>
    </div>
    <div class="about__slider">
      <VImagesSlider :slides="slides" :limit="3.5" :fixSlideWidth="fixSlideWidth">
      </VImagesSlider>
    </div>
  </section>
</template>

<script>
import VImagesSlider from '../UI-FC/VImagesSlider.vue';
import VAboutCard from '@/components/elements/VAboutCard.vue';
import mobileMixin from '@/mixins/mobileMode';


export default {
  mixins: [
    mobileMixin
  ],
  components: {
    VImagesSlider,
    VAboutCard
  },
  data() {
    return {

      slides: [
        {
          aboutCardData: {
            imgSrc: require('@/assets/img/main/about-cards/about-card-1.jpg'),
            title: 'Екатерина Константинопольская',
            text: 'Это восторг!😍 19.10.2022 г. мы провели свою свадьбу в ресторане Hotel на Пушкина. Увидела рекламу ресторана в интернете, решили приехать, посмотреть локацию. Сначала сомневалась, стоит ли устраивать свадьбу в отеле, да еще и на 4 этаже, боялась, что не сможем как следует повеселиться, пошуметь, короче отметить с размахом. НО! Как только мы приехали на место, все сомнения вообще отпали!Администратор Мария, очень милая девушка все объяснила, рассказала и показала. Шумоизоляция тут отличная, есть вообще все удобства на этаже, даже выходить никуда не надо! И очень крутой вид! Особенно вечером…'
          }
        },
        {
          aboutCardData: {
            imgSrc: require('@/assets/img/main/about-cards/about-card-2.jpg'),
            title: 'Екатерина Константинопольская',
            text: 'Ресторан - это любовь с первого взгляда❤️ Мы с будущим мужем работали рядом с Hotel и часто приходили сюда на бизнес-ланчи обедать. Все всегда было вкусно, цены хорошие и персонал невероятно приятный😍 Поэтому, когда муж сделал предложение, вопрос с местом для проведения свадьбы был решен сразу😁 Пришли уже в качестве жениха с невестой, обсудили предстоящий банкет, нам все подробно рассказали, тут же сделали предложение по меню, причем индивидуальные, под наш бюджет и пожелания, и сразу подкупили еще тем, что обещали постоянно помогать в день самого торжества! И обещание '
          }
        }, {
          aboutCardData: {
            imgSrc: require('@/assets/img/main/about-cards/about-card-3.jpg'),
            title: 'Екатерина Константинопольская',
            text: 'Выбрать ресторан в отеле для празднования свадьбы было одним из лучший решений в моей жизни😃 Потому что удобнее ничего не придумаешь. Собирались утром с женихом здесь в одном номере, здесь же очень стильную и крутую съемку провели. И гостей разместили (у нас многие приехали из разных городов, а квартиры снимать всем вышло намного дороже, поэтому отель нас очень выручил!). И здесь же остались после самого торжества, потому что куда-то еще собираться и ехать в час ночи было уже невозможно😂 Мы нереально довольны🔥 Все на высшем уровне! Кухня - одна из лучших в городе (отдельное спасибо вашему шеф-повару), персонал очень профессиональный, все вежлив  '
          }
        }, {
          aboutCardData: {
            imgSrc: require('@/assets/img/main/about-cards/about-card-4.jpg'),
            title: 'Екатерина Константинопольская',
            text: 'Это восторг!😍 19.10.2022 г. мы провели свою свадьбу в ресторане Hotel на Пушкина. Увидела рекламу ресторана в интернете, решили приехать, посмотреть локацию. Сначала сомневалась, стоит ли устраивать свадьбу в отеле, да еще и на 4 этаже, боялась, что не сможем как следует повеселиться, пошуметь, короче отметить с размахом. НО! Как только мы приехали на место, все сомнения вообще отпали!Администратор Мария, очень милая девушка все объяснила, рассказала и показала. Шумоизоляция тут отличная, есть вообще все удобства на этаже, даже выходить никуда не надо! И очень крутой вид! Особенно вечером…'
          }
        }
      ]
    }
  },
  computed: {
    fixSlideWidth() {
      return 516
    }
  }
}
</script>

<style lang='scss'>
@import '@/assets/scss/mixins.scss';
@import '@/assets/scss/smart-grid.scss';

.about {
  position: relative;
  margin-left: max(30px, calc((100% - 1588px)/2));
  padding: 62px 0 50px 62px;

  @include to(992px) {
    padding: 32px 16px 40px;
    margin-left: 0px;
  }


  &__wrap-bg {
    position: absolute;
    left: 0;
    top: 0;
    max-width: 1588px;
    width: 100%;
    height: 100%;
    padding-right: 30px;

    @include to(992px) {
      padding-right: 0px;
    }
  }

  &__bg {

    width: 100%;
    height: 100%;
    background: #F7F7F8;
    border-radius: 16px;

    margin-right: 30px;

    @include to(992px) {
      margin-right: 15px;
    }
  }

  &__slider {
    .slider__line {
      @include mr(20px)
    }

    .slider__nav {
      display: flex;
      @include mr(20px);
    }

    .slider__slide {}
  }
}
</style>