<template>
    <section class="reviews">
        <div class="container">
            <div class="reviews__body">
                <div class="reviews__slider">
                    <VImagesSlider :slides="rewiewsSlides" />
                </div>
            </div>
        </div>
    </section>
</template>
<script>
import VImagesSlider from "../UI-FC/VImagesSlider.vue"

export default {
    components: { VImagesSlider },
    data() {
        return {
            rewiewsSlides: [
                {
                    cardData: {
                        img: require("@/assets/img/main/reviews/Rectangle1.jpg"),
                        title: "Екатерина Константинопольская",
                        text: "Это восторг!😍 19.10.2022 г. мы провели свою свадьбу в ресторане Hotel на Пушкина.  Увидела рекламу ресторана в интернете, решили приехать, посмотреть локацию. Сначала сомневалась, стоит ли устраивать свадьбу в отеле, да еще и на 4 этаже, боялась, что не сможем как следует повеселиться, пошуметь, короче отметить с размахом. НО! Как только мы приехали на место, все сомнения вообще отпали! Администратор Мария, очень милая девушка все объяснила, рассказала и показала. Шумоизоляция тут отличная, есть вообще все удобства на этаже, даже выходить никуда не надо! И очень крутой вид! Особенно вечером…  ",
                    },
                },
                {
                    cardData: {
                        img: require("@/assets/img/main/reviews/Rectangle2.jpg"),
                        title: "Екатерина Константинопольская",
                        text: "Это восторг!😍 19.10.2022 г. мы провели свою свадьбу в ресторане Hotel на Пушкина.  Увидела рекламу ресторана в интернете, решили приехать, посмотреть локацию. Сначала сомневалась, стоит ли устраивать свадьбу в отеле, да еще и на 4 этаже, боялась, что не сможем как следует повеселиться, пошуметь, короче отметить с размахом. НО! Как только мы приехали на место, все сомнения вообще отпали! Администратор Мария, очень милая девушка все объяснила, рассказала и показала. Шумоизоляция тут отличная, есть вообще все удобства на этаже, даже выходить никуда не надо! И очень крутой вид! Особенно вечером…  ",
                    },
                },
                {
                    cardData: {
                        img: require("@/assets/img/main/reviews/Rectangle1.jpg"),
                        title: "Екатерина Константинопольская",
                        text: "Это восторг!😍 19.10.2022 г. мы провели свою свадьбу в ресторане Hotel на Пушкина.  Увидела рекламу ресторана в интернете, решили приехать, посмотреть локацию. Сначала сомневалась, стоит ли устраивать свадьбу в отеле, да еще и на 4 этаже, боялась, что не сможем как следует повеселиться, пошуметь, короче отметить с размахом. НО! Как только мы приехали на место, все сомнения вообще отпали! Администратор Мария, очень милая девушка все объяснила, рассказала и показала. Шумоизоляция тут отличная, есть вообще все удобства на этаже, даже выходить никуда не надо! И очень крутой вид! Особенно вечером…  ",
                    },
                },
                {
                    cardData: {
                        img: require("@/assets/img/main/reviews/Rectangle2.jpg"),
                        title: "Екатерина Константинопольская",
                        text: "Это восторг!😍 19.10.2022 г. мы провели свою свадьбу в ресторане Hotel на Пушкина.  Увидела рекламу ресторана в интернете, решили приехать, посмотреть локацию. Сначала сомневалась, стоит ли устраивать свадьбу в отеле, да еще и на 4 этаже, боялась, что не сможем как следует повеселиться, пошуметь, короче отметить с размахом. НО! Как только мы приехали на место, все сомнения вообще отпали! Администратор Мария, очень милая девушка все объяснила, рассказала и показала. Шумоизоляция тут отличная, есть вообще все удобства на этаже, даже выходить никуда не надо! И очень крутой вид! Особенно вечером…  ",
                    },
                },
            ],
        }
    },
}
</script>
<style lang="scss">
@import "@/assets/scss/smart-grid.scss";
@import "@/assets/scss/mixins.scss";
</style>
